ci4/app/Controllers/Artikel.php

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel', 'Lorem Ipsum', 'Artikel')
---
public function add()
{
// validasi data.
$validation = \Config\Services::validation();
$validation->setRules(['judul' => 'required']);
$isDataValid = $validation->withRequest($this->request)->run();
if ($isDataValid)
{
$artikel = new ArtikelModel();
$artikel->insert([
'judul' => $this->request->getPost('judul'),
'isi' => $this->request->getPost('isi'),
'slug' => url_title($this->request->getPost('judul')),
]);